ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/EQEP_EQEP_50270000h.xml
<module name="EQEP" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="EQEP_QPOSCNT" acronym="EQEP_QPOSCNT" offset="0" width="32" description="Position Counter .">
		<bitfield id="QPOSCNT" width="32" begin="31" end="0" resetval="0x0" description="Position Counter  This 32-bit position counter register counts up/down on every eQEP pulse based on direction input. This counter acts as a position integrator whose count value is proportional to position from a give reference point. This Register acts as a Read ONLY register while counter is counting up/down.  Note: It is recommended to only write to the position counter register [QPOSCNT] during initialization, i.e. when the eQEP position counter is disabled [QPEN bit of QEPCTL is zero]. Once the position counter is enabled [QPEN bit is one], Writing to the eQEP position counter register [QPOSCNT] may cause unexpected results." range="31:0" rwaccess="R/W"/>
	</register><register id="EQEP_QPOSINIT" acronym="EQEP_QPOSINIT" offset="4" width="32" description="Position Counter Init .">
		<bitfield id="QPOSINIT" width="32" begin="31" end="0" resetval="0x0" description="Position Counter Init This register contains the position value that is used to initialize the position counter based on external strobe or index event. The position counter can be initialized through software. Writes to this register should always be full 32-bit writes." range="31:0" rwaccess="R/W"/>
	</register><register id="EQEP_QPOSMAX" acronym="EQEP_QPOSMAX" offset="8" width="32" description="Maximum Position Count .">
		<bitfield id="QPOSMAX" width="32" begin="31" end="0" resetval="0x0" description="Maximum Position Count This register contains the maximum position counter value. Writes to this register should always be full 32-bit writes." range="31:0" rwaccess="R/W"/>
	</register><register id="EQEP_QPOSCMP" acronym="EQEP_QPOSCMP" offset="12" width="32" description="Position Compare .">
		<bitfield id="QPOSCMP" width="32" begin="31" end="0" resetval="0x0" description="Position Compare  The position-compare value in this register is compared with the position counter [QPOSCNT] to generate sync output and/or interrupt on compare match." range="31:0" rwaccess="R/W"/>
	</register><register id="EQEP_QPOSILAT" acronym="EQEP_QPOSILAT" offset="16" width="32" description="Index Position Latch .">
		<bitfield id="QPOSILAT" width="32" begin="31" end="0" resetval="0x0" description="Index Position Latch   The position-counter value is latched into this register on an index event as defined by the QEPCTL[IEL] bits." range="31:0" rwaccess="R"/>
	</register><register id="EQEP_QPOSSLAT" acronym="EQEP_QPOSSLAT" offset="20" width="32" description="Strobe Position Latch.">
		<bitfield id="QPOSSLAT" width="32" begin="31" end="0" resetval="0x0" description="Strobe Position Latch   The position-counter value is latched into this register on a strobe event as defined by the QEPCTL[SEL] bits." range="31:0" rwaccess="R"/>
	</register><register id="EQEP_QPOSLAT" acronym="EQEP_QPOSLAT" offset="24" width="32" description="Position Latch .">
		<bitfield id="QPOSLAT" width="32" begin="31" end="0" resetval="0x0" description="Position Latch   The position-counter value is latched into this register on a unit time out event." range="31:0" rwaccess="R"/>
	</register><register id="EQEP_QUTMR" acronym="EQEP_QUTMR" offset="28" width="32" description="QEP Unit Timer .">
		<bitfield id="QUTMR" width="32" begin="31" end="0" resetval="0x0" description="QEP Unit Timer This register acts as time base for unit time event generation. When this timer value matches the unit time period value a unit time event is generated." range="31:0" rwaccess="R/W"/>
	</register><register id="EQEP_QUPRD" acronym="EQEP_QUPRD" offset="32" width="32" description="QEP Unit Period .">
		<bitfield id="QUPRD" width="32" begin="31" end="0" resetval="0x0" description="QEP Unit Period This register contains the period count for the unit timer to generate periodic unit time events. These events latch the eQEP position information at periodic intervals and optionally generate an interrupt. Writes to this register should always be full 32-bit writes." range="31:0" rwaccess="R/W"/>
	</register><register id="EQEP_QWDTMR" acronym="EQEP_QWDTMR" offset="36" width="16" description="QEP Watchdog Timer .">
		<bitfield id="QWDTMR" width="16" begin="15" end="0" resetval="0x0" description="QEP Watchdog Timer  This register acts as time base for the watchdog to detect motor stalls. When this timer value matches with the watchdog's period value a watchdog timeout interrupt is generated. This register is reset upon edge transition in quadrature-clock indicating the motion." range="15:0" rwaccess="R/W"/>
	</register><register id="EQEP_QWDPRD" acronym="EQEP_QWDPRD" offset="38" width="16" description="QEP Watchdog Period .">
		<bitfield id="QWDPRD" width="16" begin="15" end="0" resetval="0x0" description="QEP Watchdog Period  This register contains the time-out count for the eQEP peripheral watch dog timer. When the watchdog timer value matches the watchdog period value, a watchdog timeout interrupt is generated." range="15:0" rwaccess="R/W"/>
	</register><register id="EQEP_QDECCTL" acronym="EQEP_QDECCTL" offset="40" width="16" description="Quadrature Decoder Control .">
		<bitfield id="QSRC" width="2" begin="15" end="14" resetval="0x0" description="Position-counter source selection" range="15:14" rwaccess="R/W"/>
	<bitfield id="SOEN" width="1" begin="13" end="13" resetval="0x0" description="Sync output-enable 0      Disable position-compare sync output1      Enable position-compare sync output" range="13" rwaccess="R/W"/>
	<bitfield id="SPSEL" width="1" begin="12" end="12" resetval="0x0" description="Sync output pin selection 0      Index pin is used for sync output1      Strobe pin is used for sync output" range="12" rwaccess="R/W"/>
	<bitfield id="XCR" width="1" begin="11" end="11" resetval="0x0" description="External Clock Rate 0      2x resolution: Count the rising/falling       edge1      1x resolution: Count the rising edge only" range="11" rwaccess="R/W"/>
	<bitfield id="SWAP" width="1" begin="10" end="10" resetval="0x0" description="CLK/DIR Signal Source for Position Counter  0      Quadrature-clock inputs are not swapped1      Quadrature-clock inputs are swapped" range="10" rwaccess="R/W"/>
	<bitfield id="IGATE" width="1" begin="9" end="9" resetval="0x0" description="Index pulse gating option 0      Disable gating of Index pulse1      Gate the index pin with strobe" range="9" rwaccess="R/W"/>
	<bitfield id="QAP" width="1" begin="8" end="8" resetval="0x0" description="QEPA input polarity 0      No effect1      Negates QEPA input" range="8" rwaccess="R/W"/>
	<bitfield id="QBP" width="1" begin="7" end="7" resetval="0x0" description="QEPB input polarity 0      No effect1      Negates QEPB input" range="7" rwaccess="R/W"/>
	<bitfield id="QIP" width="1" begin="6" end="6" resetval="0x0" description="QEPI input polarity 0      No effect1      Negates QEPI input" range="6" rwaccess="R/W"/>
	<bitfield id="QSP" width="1" begin="5" end="5" resetval="0x0" description="QEPS input polarity 0      No effect1      Negates QEPS input" range="5" rwaccess="R/W"/>
	<bitfield id="QIDIRE" width="1" begin="0" end="0" resetval="0x0" description="0 - Compatible mode, Behavior same as existing devices 1 - Enhancement for Direction change during Index will be enabled" range="0" rwaccess="R/W"/>
	</register><register id="EQEP_QEPCTL" acronym="EQEP_QEPCTL" offset="42" width="16" description="QEP Control .">
		<bitfield id="FREE_SOFT" width="2" begin="15" end="14" resetval="0x0" description="Emulation mode  0      QPOSCNT behavior  Position counter stops       immediately on emulation suspend  0h (R/W)       = QWDTMR behavior  Watchdog counter stops       immediately  0h (R/W) = QUTMR behavior       Unit timer stops immediately  0h (R/W) =       QCTMR behavior  Capture Timer stops       immediately1      QPOSCNT behavior  Position counter       continues to count until the rollover  1h       (R/W) = QWDTMR behavior  Watchdog counter       counts until WD period match roll over  1h       (R/W) = QUTMR behavior  Unit timer counts       until period rollover  1h (R/W) = QCTMR       behavior  Capture Timer counts until next       unit period event2      QPOSCNT behavior  Position counter is       unaffected by emulation suspend  2h (R/W) =       QWDTMR behavior  Watchdog counter is       unaffected by emulation suspend  2h (R/W) =       QUTMR behavior  Unit timer is unaffected by       emulation suspend  2h (R/W) = QCTMR       behavior  Capture Timer is unaffected by       emulation suspend3      Same as FREE_SOFT_2" range="15:14" rwaccess="R/W"/>
	<bitfield id="PCRM" width="2" begin="13" end="12" resetval="0x0" description="Postion counter reset  0      Position counter reset on an index event1      Position counter reset on the maximum       position2      Position counter reset on the first index       event3      Position counter reset on a unit time event" range="13:12" rwaccess="R/W"/>
	<bitfield id="SEI" width="2" begin="11" end="10" resetval="0x0" description="Strobe event initialization of position counter 0      Does nothing (action disabled)1      Does nothing (action disabled)2      Initializes the position counter on rising       edge of the QEPS signal3      Clockwise Direction:  Initializes the       position counter on the rising edge of QEPS       strobe  Counter Clockwise Direction:       Initializes the position counter on the       falling edge of QEPS strobe" range="11:10" rwaccess="R/W"/>
	<bitfield id="IEI" width="2" begin="9" end="8" resetval="0x0" description="Index event init of position count  0      Do nothing (action disabled)1      Do nothing (action disabled)2      Initializes the position counter on the       rising edge of the QEPI signal (QPOSCNT =       QPOSINIT)3      Initializes the position counter on the       falling edge of QEPI signal (QPOSCNT =       QPOSINIT)" range="9:8" rwaccess="R/W"/>
	<bitfield id="SWI" width="1" begin="7" end="7" resetval="0x0" description="Software init position counter 0      Do nothing (action disabled)1      Initialize position counter       (QPOSCNT=QPOSINIT). This bit is not cleared       automatically" range="7" rwaccess="R/W"/>
	<bitfield id="SEL" width="1" begin="6" end="6" resetval="0x0" description="Strobe event latch of position counter 0      The position counter is latched on the       rising edge of QEPS strobe (QPOSSLAT =       POSCCNT). Latching on the falling edge can       be done by inverting the strobe input using       the QSP bit in the QDECCTL register1      Clockwise Direction:  Position counter is       latched on rising edge of QEPS strobe       Counter Clockwise Direction:  Position       counter is latched on falling edge of QEPS       strobe" range="6" rwaccess="R/W"/>
	<bitfield id="IEL" width="2" begin="5" end="4" resetval="0x0" description="Index event latch of position counter [software index marker] 0      Reserved1      Latches position counter on rising edge of       the index signal2      Latches position counter on falling edge of       the index signal3      Software index marker. Latches the position       counter and quadrature direction flag on       index event marker. The position counter is       latched to the QPOSILAT register and the       direction flag is latched in the       QEPSTS[QDLF] bit. This mode is useful for       software index marking." range="5:4" rwaccess="R/W"/>
	<bitfield id="QPEN" width="1" begin="3" end="3" resetval="0x0" description="Quadrature position counter enable/software reset 0      Reset the eQEP peripheral internal       operating flags/read-only registers.       Control/configuration registers are not       disturbed by a software reset.  When QPEN       is disabled, some flags in the QFLG       register do not get reset or cleared and       show the actual state of that flag.1      eQEP position counter is enabled" range="3" rwaccess="R/W"/>
	<bitfield id="QCLM" width="1" begin="2" end="2" resetval="0x0" description="QEP capture latch mode  0      Latch on position counter read by CPU.       Capture timer and capture period values are       latched into QCTMRLAT and QCPRDLAT       registers when CPU reads the QPOSCNT       register.1      Latch on unit time out. Position counter,       capture timer and capture period values are       latched into QPOSLAT, QCTMRLAT and QCPRDLAT       registers on unit time out." range="2" rwaccess="R/W"/>
	<bitfield id="UTE" width="1" begin="1" end="1" resetval="0x0" description="QEP unit timer enable 0      Disable eQEP unit timer1      Enable unit timer" range="1" rwaccess="R/W"/>
	<bitfield id="WDE" width="1" begin="0" end="0" resetval="0x0" description="QEP watchdog enable  0      Disable the eQEP watchdog timer1      Enable the eQEP watchdog timer" range="0" rwaccess="R/W"/>
	</register><register id="EQEP_QCAPCTL" acronym="EQEP_QCAPCTL" offset="44" width="16" description="Qaudrature Capture Control .">
		<bitfield id="CEN" width="1" begin="15" end="15" resetval="0x0" description="Enable eQEP capture 0      eQEP capture unit is disabled1      eQEP capture unit is enabled" range="15" rwaccess="R/W"/>
	<bitfield id="CCPS" width="3" begin="6" end="4" resetval="0x0" description="EQEP capture timer clock prescaler 0      CAPCLK = SYSCLKOUT/11      CAPCLK = SYSCLKOUT/22      CAPCLK = SYSCLKOUT/43      CAPCLK = SYSCLKOUT/84      CAPCLK = SYSCLKOUT/165      CAPCLK = SYSCLKOUT/326      CAPCLK = SYSCLKOUT/647      CAPCLK = SYSCLKOUT/128" range="6:4" rwaccess="R/W"/>
	<bitfield id="UPPS" width="4" begin="3" end="0" resetval="0x0" description="Unit position event prescaler 0      UPEVNT = QCLK/11      UPEVNT = QCLK/22      UPEVNT = QCLK/43      UPEVNT = QCLK/84      UPEVNT = QCLK/165      UPEVNT = QCLK/326      UPEVNT = QCLK/647      UPEVNT = QCLK/1288      UPEVNT = QCLK/2569      UPEVNT = QCLK/51210     UPEVNT = QCLK/102411     UPEVNT = QCLK/204812     Reserved13     Reserved14     Reserved15     Reserved" range="3:0" rwaccess="R/W"/>
	</register><register id="EQEP_QPOSCTL" acronym="EQEP_QPOSCTL" offset="46" width="16" description="Position Compare Control .">
		<bitfield id="PCSHDW" width="1" begin="15" end="15" resetval="0x0" description="Position compare of shadow enable 0      Shadow disabled, load Immediate1      Shadow enabled" range="15" rwaccess="R/W"/>
	<bitfield id="PCLOAD" width="1" begin="14" end="14" resetval="0x0" description="Position compare of shadow load  0      Load on QPOSCNT = 01      Load when QPOSCNT = QPOSCMP" range="14" rwaccess="R/W"/>
	<bitfield id="PCPOL" width="1" begin="13" end="13" resetval="0x0" description="Polarity of sync output  0      Active HIGH pulse output1      Active LOW pulse output" range="13" rwaccess="R/W"/>
	<bitfield id="PCE" width="1" begin="12" end="12" resetval="0x0" description="Position compare enable/disable  0      Disable position compare unit1      Enable position compare unit" range="12" rwaccess="R/W"/>
	<bitfield id="PCSPW" width="12" begin="11" end="0" resetval="0x0" description="Select-position-compare sync output pulse width 0      1 * 4 * SYSCLKOUT cycles1      2 * 4 * SYSCLKOUT cycles4095   4096 * 4 * SYSCLKOUT cycles" range="11:0" rwaccess="R/W"/>
	</register><register id="EQEP_QEINT" acronym="EQEP_QEINT" offset="48" width="16" description="QEP Interrupt Control .">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="QMA Error Interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="12" rwaccess="R/W"/>
	<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Unit time out interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="11" rwaccess="R/W"/>
	<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Index event latch interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="10" rwaccess="R/W"/>
	<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Strobe event latch interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="9" rwaccess="R/W"/>
	<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Position-compare match interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="8" rwaccess="R/W"/>
	<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Position-compare ready interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="7" rwaccess="R/W"/>
	<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Position counter overflow interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="6" rwaccess="R/W"/>
	<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Position counter underflow interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="5" rwaccess="R/W"/>
	<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Watchdog time out interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="4" rwaccess="R/W"/>
	<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Quadrature direction change interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="3" rwaccess="R/W"/>
	<bitfield id="QPE" width="1" begin="2" end="2" resetval="0x0" description="Quadrature phase error interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="2" rwaccess="R/W"/>
	<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Position counter error interrupt enable 0      Interrupt is disabled1      Interrupt is enabled" range="1" rwaccess="R/W"/>
	</register><register id="EQEP_QFLG" acronym="EQEP_QFLG" offset="50" width="16" description="QEP Interrupt Flag .">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="QMA Error interrupt flag 0      No interrupt generated1      Interrupt was generated" range="12" rwaccess="R"/>
	<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Unit time out interrupt flag 0      No interrupt generated1      Set by eQEP unit timer period match" range="11" rwaccess="R"/>
	<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Index event latch interrupt flag 0      No interrupt generated1      This bit is set after latching the QPOSCNT       to QPOSILAT" range="10" rwaccess="R"/>
	<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Strobe event latch interrupt flag 0      No interrupt generated1      This bit is set after latching the QPOSCNT       to QPOSSLAT" range="9" rwaccess="R"/>
	<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="EQEP compare match event interrupt flag 0      No interrupt generated1      This bit is set on position-compare match" range="8" rwaccess="R"/>
	<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Position-compare ready interrupt flag 0      No interrupt generated1      This bit is set after transferring the       shadow register value to the active       position compare register" range="7" rwaccess="R"/>
	<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Position counter overflow interrupt flag 0      No interrupt generated1      This bit is set on position counter       overflow." range="6" rwaccess="R"/>
	<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Position counter underflow interrupt flag 0      No interrupt generated1      This bit is set on position counter       underflow." range="5" rwaccess="R"/>
	<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Watchdog timeout interrupt flag 0      No interrupt generated1      Set by watchdog timeout" range="4" rwaccess="R"/>
	<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Quadrature direction change interrupt flag 0      No interrupt generated1      Interrupt was generated" range="3" rwaccess="R"/>
	<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Quadrature phase error interrupt flag 0      No interrupt generated1      Set on simultaneous transition of QEPA and       QEPB" range="2" rwaccess="R"/>
	<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Position counter error interrupt flag 0      No interrupt generated1      Position counter error" range="1" rwaccess="R"/>
	<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global interrupt status flag 0      No interrupt generated1      Interrupt was generated" range="0" rwaccess="R"/>
	</register><register id="EQEP_QCLR" acronym="EQEP_QCLR" offset="52" width="16" description="QEP Interrupt Clear .">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="Clear QMA Error interrupt flag 0      No effect1      Clears the interrupt flag" range="12" rwaccess="R/W1TS"/>
	<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Clear unit time out interrupt flag 0      No effect1      Clears the interrupt flag" range="11" rwaccess="R/W1TS"/>
	<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Clear index event latch interrupt flag 0      No effect1      Clears the interrupt flag" range="10" rwaccess="R/W1TS"/>
	<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Clear strobe event latch interrupt flag 0      No effect1      Clears the interrupt flag" range="9" rwaccess="R/W1TS"/>
	<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Clear eQEP compare match event interrupt flag 0      No effect1      Clears the interrupt flag" range="8" rwaccess="R/W1TS"/>
	<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Clear position-compare ready interrupt flag 0      No effect1      Clears the interrupt flag" range="7" rwaccess="R/W1TS"/>
	<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Clear position counter overflow interrupt flag 0      No effect1      Clears the interrupt flag" range="6" rwaccess="R/W1TS"/>
	<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Clear position counter underflow interrupt flag 0      No effect1      Clears the interrupt flag" range="5" rwaccess="R/W1TS"/>
	<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Clear watchdog timeout interrupt flag 0      No effect1      Clears the interrupt flag" range="4" rwaccess="R/W1TS"/>
	<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Clear quadrature direction change interrupt flag 0      No effect1      Clears the interrupt flag" range="3" rwaccess="R/W1TS"/>
	<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Clear quadrature phase error interrupt flag 0      No effect1      Clears the interrupt flag" range="2" rwaccess="R/W1TS"/>
	<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Clear position counter error interrupt flag 0      No effect1      Clears the interrupt flag" range="1" rwaccess="R/W1TS"/>
	<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global interrupt clear flag 0      No effect1      Clears the interrupt flag" range="0" rwaccess="R/W1TS"/>
	</register><register id="EQEP_QFRC" acronym="EQEP_QFRC" offset="54" width="16" description="QEP Interrupt Force .">
		<bitfield id="QMAE" width="1" begin="12" end="12" resetval="0x0" description="Force QMA error interrupt 0      No effect1      Force the interrupt" range="12" rwaccess="R/W"/>
	<bitfield id="UTO" width="1" begin="11" end="11" resetval="0x0" description="Force unit time out interrupt 0      No effect1      Force the interrupt" range="11" rwaccess="R/W"/>
