ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/EQEP_EQEP_50270000h.xml
	<bitfield id="IEL" width="1" begin="10" end="10" resetval="0x0" description="Force index event latch interrupt 0      No effect1      Force the interrupt" range="10" rwaccess="R/W"/>
	<bitfield id="SEL" width="1" begin="9" end="9" resetval="0x0" description="Force strobe event latch interrupt 0      No effect1      Force the interrupt" range="9" rwaccess="R/W"/>
	<bitfield id="PCM" width="1" begin="8" end="8" resetval="0x0" description="Force position-compare match interrupt 0      No effect1      Force the interrupt" range="8" rwaccess="R/W"/>
	<bitfield id="PCR" width="1" begin="7" end="7" resetval="0x0" description="Force position-compare ready interrupt 0      No effect1      Force the interrupt" range="7" rwaccess="R/W"/>
	<bitfield id="PCO" width="1" begin="6" end="6" resetval="0x0" description="Force position counter overflow interrupt 0      No effect1      Force the interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="PCU" width="1" begin="5" end="5" resetval="0x0" description="Force position counter underflow interrupt 0      No effect1      Force the interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="WTO" width="1" begin="4" end="4" resetval="0x0" description="Force watchdog time out interrupt 0      No effect1      Force the interrupt" range="4" rwaccess="R/W"/>
	<bitfield id="QDC" width="1" begin="3" end="3" resetval="0x0" description="Force quadrature direction change interrupt 0      No effect1      Force the interrupt" range="3" rwaccess="R/W"/>
	<bitfield id="PHE" width="1" begin="2" end="2" resetval="0x0" description="Force quadrature phase error interrupt 0      No effect1      Force the interrupt" range="2" rwaccess="R/W"/>
	<bitfield id="PCE" width="1" begin="1" end="1" resetval="0x0" description="Force position counter error interrupt 0      No effect1      Force the interrupt" range="1" rwaccess="R/W"/>
	</register><register id="EQEP_QEPSTS" acronym="EQEP_QEPSTS" offset="56" width="16" description="QEP Status .">
		<bitfield id="UPEVNT" width="1" begin="7" end="7" resetval="0x1" description="Unit position event flag 0      No unit position event detected1      Unit position event detected. Write 1 to       clear" range="7" rwaccess="R/W1TS"/>
	<bitfield id="FIDF" width="1" begin="6" end="6" resetval="0x0" description="Direction on the first index marker Status of the direction is latched on the first index event marker. 0      Counter-clockwise rotation (or reverse       movement) on the first index event1      Clockwise rotation (or forward movement) on       the first index event" range="6" rwaccess="R"/>
	<bitfield id="QDF" width="1" begin="5" end="5" resetval="0x0" description="Quadrature direction flag 0      Counter-clockwise rotation (or reverse       movement)1      Clockwise rotation (or forward movement)" range="5" rwaccess="R"/>
	<bitfield id="QDLF" width="1" begin="4" end="4" resetval="0x0" description="EQEP direction latch flag 0      Counter-clockwise rotation (or reverse       movement) on index event marker1      Clockwise rotation (or forward movement) on       index event marker" range="4" rwaccess="R"/>
	<bitfield id="COEF" width="1" begin="3" end="3" resetval="0x0" description="Capture overflow error flag 0      Overflow has not occurred.1      Overflow occurred in eQEP Capture timer       (QEPCTMR). This bit is cleared by writing a       '1'." range="3" rwaccess="R/W1TS"/>
	<bitfield id="CDEF" width="1" begin="2" end="2" resetval="0x0" description="Capture direction error flag 0      Capture direction error has not occurred.1      Direction change occurred between the       capture position event. This bit is cleared       by writing a '1'." range="2" rwaccess="R/W1TS"/>
	<bitfield id="FIMF" width="1" begin="1" end="1" resetval="0x0" description="First index marker flag 0      First index pulse has not occurred.1      Set by first occurrence of index pulse.       This bit is cleared by writing a '1'." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PCEF" width="1" begin="0" end="0" resetval="0x0" description="Position counter error flag.  This bit is not sticky and it is updated for every index event. 0      No error occurred during the last index       transition1      Position counter error" range="0" rwaccess="R"/>
	</register><register id="EQEP_QCTMR" acronym="EQEP_QCTMR" offset="58" width="16" description="QEP Capture Timer .">
		<bitfield id="QCTMR" width="16" begin="15" end="0" resetval="0x0" description="This register provides time base for edge capture unit." range="15:0" rwaccess="R/W"/>
	</register><register id="EQEP_QCPRD" acronym="EQEP_QCPRD" offset="60" width="16" description="QEP Capture Period .">
		<bitfield id="QCPRD" width="16" begin="15" end="0" resetval="0x0" description="This register holds the period count value between the last successive eQEP position events" range="15:0" rwaccess="R/W"/>
	</register><register id="EQEP_QCTMRLAT" acronym="EQEP_QCTMRLAT" offset="62" width="16" description="QEP Capture Latch .">
		<bitfield id="QCTMRLAT" width="16" begin="15" end="0" resetval="0x0" description="The eQEP capture timer value can be latched into this register on two events viz., unit timeout event, Reading the eQEP position counter." range="15:0" rwaccess="R"/>
	</register><register id="EQEP_QCPRDLAT" acronym="EQEP_QCPRDLAT" offset="64" width="16" description="QEP Capture Period Latch .">
		<bitfield id="QCPRDLAT" width="16" begin="15" end="0" resetval="0x0" description="EQEP capture period value can be latched into this register on two events viz., unit timeout event, Reading the eQEP position counter." range="15:0" rwaccess="R"/>
	</register><register id="EQEP_REV" acronym="EQEP_REV" offset="96" width="32" description="QEP Revision Number.">
		<bitfield id="MINOR" width="3" begin="5" end="3" resetval="0x2" description="This field specifies the Minor Revision number for the eQEP IP. " range="5:3" rwaccess="R"/>
	<bitfield id="MAJOR" width="3" begin="2" end="0" resetval="0x1" description="This field specifies the Major Revision number for the eQEP IP. " range="2:0" rwaccess="R"/>
	</register><register id="EQEP_QMACTRL" acronym="EQEP_QMACTRL" offset="104" width="32" description="QMA Control register.">
		<bitfield id="MODE" width="3" begin="2" end="0" resetval="0x0" description="Select Mode for QMA mode: 000 : QMA Module is bypassed.  001 : QMA Mode-1 operation selected 010 : QMA Mode-2 operation selected 011 : QMA Module is bypassed [reserved] 1xx  : QMA Module is bypassed [reserved]" range="2:0" rwaccess="R/W"/>
	</register><register id="EQEP_QEPSRCSEL" acronym="EQEP_QEPSRCSEL" offset="108" width="32" description="QEP Source Select Register.">
		<bitfield id="QEPSSEL" width="5" begin="28" end="24" resetval="0x0" description="QEP Strobe source select:  0x0 : Reserved 0x1 : Device Pin 0x2 : PWMXBAR.Out[0]  0x3 : PWMXBAR.Out[1] ... 0x1F : PWMXBAR.Out[29]  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="28:24" rwaccess="R/W"/>
	<bitfield id="QEPISEL" width="5" begin="20" end="16" resetval="0x0" description="QEP Index source select: 0x0 : Reserved 0x1 : Device Pin 0x2 : PWMXBAR.Out[0]  0x3 : PWMXBAR.Out[1] ... 0x1F : PWMXBAR.Out[29]  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="20:16" rwaccess="R/W"/>
	<bitfield id="QEPBSEL" width="5" begin="12" end="8" resetval="0x0" description="QEPB source select: 0x0 : Reserved 0x1 : Device Pin 0x2 : PWMXBAR.Out[0]  0x3 : PWMXBAR.Out[1] ... 0x1F : PWMXBAR.Out[29]  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="12:8" rwaccess="R/W"/>
	<bitfield id="QEPASEL" width="5" begin="4" end="0" resetval="0x0" description="QEPA source select: 0x0 : Reserved 0x1 : Device Pin 0x2 : PWMXBAR.Out[0]  0x3 : PWMXBAR.Out[1] ... 0x1F : PWMXBAR.Out[29]  Note: eQEP needs to be disabled before configuring these bits as it can lead to unexpected behavior if eQEP is running." range="4:0" rwaccess="R/W"/>
	</register>
</module>